#即自定义迭代器
def func() :
     print("4888")
     yield 1
     print('78')
     yield 2
     print('595')
     yield 3
     print('55')

# func().__next__()
# func().__next__()
# func().__next__()
#返回值全是448

g=func()
p=g.__next__()
x=g.__next__()
y=next(g)
print(p,x,y)
'''在第一种情况中，你使用了 func().__next__() 三次，每次都创建了一个新的生成器对象并调用了 __next__() 方法。这意味
着你每次都在生成器函数 func() 中的第一个 yield 语句处开始执行生成器，因此只会打印 "4888" 并返回 1，而后两个生成器对象
都没有执行过后面的 yield 语句。

在第二种情况中，你首先创建了一个生成器对象 g 并调用了 g.__next__() 三次。这个生成器对象 g 保持了状态，它会继续执行生成
器函数中的下一个 yield 语句。因此，第一次调用 g.__next__() 时打印 "4888" 并返回 1，第二次调用时继续执行打印 "78" 
并返回 2，第三次调用时继续执行打印 "595" 并返回 3。每次调用都会继续生成器函数的执行，而不是重新开始。

所以，第一种情况每次都创建了一个新的生成器对象，因此只打印了 "4888" 并返回 1，而第二种情况使用了同一个生成器对象 g，因
此可以继续执行生成器函数的下一步。'''