# 什么是线程
# 为什么要有线程
# 如何使用
'''
进程：资源单位
线程：执行单位

将操作系统比喻成一个大的工厂，
那么进程就相当于工厂里面的车间
而线程就是车间里面的流水线

每一个进程肯定自带一个线程

再次总结：
    进程：资源单位（起一个进程仅仅只是在内存中开辟一块独立的空间）
    线程：执行单位（真正被cpu执行的其实是进程里面的线程，线程指的就是代码的执行过程，
    执行代码中所需要使用到的资源都找所在的线程索要）

进程和线程都是虚拟单位，只是为了我们更方便得描述问题

'''

'''
为什么要有线程

开设进程
1.申请内存空间 耗资源
2.‘拷贝代码’   耗资源
开线程
    一个进程内可以开设多个线程，
    在用一个进程内开设多个线程无需再次申请内存空间及拷贝代码的操作

总结：开设线程的开销要远远的小于进程的开销
    同一个进程下的多个线程数据是共享的
'''

'''
我们要开发一款文本编辑器
获取用户输入的功能
实时展示到屏幕的功能
自动保存到硬盘的功能针对上面这三个功能，
开设进程还是线成合适???

三个线程更合适  因为数据是共享的，开进程还需要队列

'''