#先定义类

#再调用类产生对象

# 类的命名用驼峰体
#类是对象相似数据与功能的集合体
#所以类中最常见的变量与函数的定义，但是类体其实是可以包含任意其他代码的
#注意：类体代码是在类定义阶段就会立即执行,会产生名称空间

class Student:
    # 变量的定义(共有的数据 )
    school='清华大学'
    # 功能的定义
    #该方法会在对象产生之后自动执行，专门为对象进行初始化操作，可以有任意代码，但一定不能返回非None的值
    #类的调用阶段执行   调用类的时候执行init方法
    def __init__(self,name,sex,age):
        self.name=name
        self.sex=sex
        self.age=age

    def choose(self):
        print('%s is choosing a course' %self.name)


    # print('asdadasdasdas========asdadasdasda')


# print(Student.__dict__)#产看字典（类的名称空间）
#
#
# #属性访问的语法   点 ......
# print(Student.__dict__['school'])#字典里的键是字符串形式
# '========'
# print(Student.school)

#调用类的过程称为实例化,发生了三件事
# 1.先产生一个空对象
# 2.python会自动调用类中的__init__方法，
# 然后将空对象以及调用类是括号内传入的参数一同传给__init__
# 3.返回初始化完的对象
stu_1 = Student('asd','male',15)
stu_1.choose()
stu_2 = Student('asd','male',16)
print(stu_1.__dict__)#{'name': 'asd', 'sex': 'male', 'age': 15}

#对象自己名称空间中没有的属性到类中去找
# 如果是赋值，则自己产生新的名称空间，而不是从类中的去改变

 #总结__init__方法
 #1.会在调用式自动触发执行，用来为对象初始化自己独有的数据
 #2.__init__内应该存放的是为对象初始化属性的功能，但是是可以存放任意其他代码的
 #想要在类的调用时立即执行的代码都可以放到该方法内
 # 3.___init__方法必须返回None

#类中存放的是对象共有的数据与功能
#类可以访问：
# 1.类的数据属性
#2.类的函数属性

# 二：但其实类中的东西是给对象用的
# 1.类的数据属性是共享给所有对象用的，大家访问的地址都一样
print(id(stu_1.school))  # 1692194165200
print(id(stu_2.school))  # 1692194165200


# 2.类的函数属性是绑定给对象用的
#绑定方法的特殊之处在于：谁来调用绑定方法就会将
# 谁当做第一个参数自动传入，所以要有self接收


# __init__内是私有的方法，但需要传入的





