# -*- coding: utf-8 -*-
"""
Created on Thu Jan 18 16:33:30 2024

@author: senji
"""

# 划分数据集为训练集、验证集和测试集是为了更有效地评估机器学习模型的性能。以下是划分为训练集、验证集和测试集与只划分为训练集和测试集的区别以及各自的好处：

# 1. **划分为训练集和测试集：**
#    - **区别：** 数据被分为两个部分，一个用于训练模型，另一个用于测试模型的性能。
#    - **好处：** 简单，易于实施。可以提供一个初步的模型性能评估。

# 2. **划分为训练集、验证集和测试集：**
#    - **区别：** 数据被分为三个部分，训练集用于训练模型，验证集用于调整模型超参数和进行模型选择，测试集用于最终评估模型性能。
#    - **好处：**
#       - **模型选择：** 允许在验证集上进行超参数调整和模型选择，以提高模型的泛化能力。
#       - **防止过拟合：** 验证集的使用有助于防止模型在训练集上过度拟合，因为模型的性能不再依赖于单一的数据集。
#       - **更可靠的性能评估：** 测试集用于最终评估模型的性能，因此提供了更可靠的泛化性能估计。

# 总体而言，划分为训练集、验证集和测试集的方法更为严谨，能够更好地评估模型在未见过的数据上的性能。这种方法可以帮助调整模型以取得更好的泛化能力，同时防止对训练数据的过拟合。



'''''
# 另外需要强调的一点是，由于交叉验证的存在，此时测试集的作用就变成了验证网格搜索是否有效，
# 而非去验证模型是否有效（此时模型是否有效由验证集来验证）。由于此时我们提交给测试集进行测试的
# ，都是经过交叉验证挑选出来的最好的一组参数、或者说至少是在验证集上效果不错的参数（往往也是评估
# 指标比较高的参数），而此时如果模型在测试集上运行效果不好、或者说在测试集上评估指标表现不佳，
# 则说明模型仍然还是过拟合，之前执行的网格搜索过程并没有很好的控制住模型的结构风险，据此我们需
# 要调整此前的调参策略，如调整参数空间、或者更改交叉验证策略等。        
# &emsp;&emsp;当然，如果是对网格搜索的过程比较自信，也可以不划分测试集，直接带入全部数据进行模型训练。