# -*- coding: utf-8 -*-
"""
Created on Tue Jan 16 11:07:18 2024

@author: senji
"""




# 岭回归（Ridge Regression）和 Lasso 正则化（Least Absolute Shrinkage and Selection Operator）都是用于线性回归模型的正则化方法，它们在处理系数上有一些重要的差异。

# 1. **正则化项的形式：**
#    - **岭回归：** 岭回归使用 L2 范数作为正则化项，其目标函数中包含了系数的平方和。岭回归的目标函数为：
#      \[ J(\theta) = \text{Least Squares Loss} + \alpha \sum_{i=1}^{n} \theta_i^2 \]
#    - **Lasso 正则化：** Lasso 使用 L1 范数作为正则化项，其目标函数中包含了系数的绝对值和。Lasso 正则化的目标函数为：
#      \[ J(\theta) = \text{Least Squares Loss} + \alpha \sum_{i=1}^{n} |\theta_i| \]

# 2. **系数的稀疏性：**
#    - **岭回归：** 岭回归的正则化项倾向于使系数趋于但不等于零，有助于解决共线性问题，但不会导致严格的系数稀疏性。
#    - **Lasso 正则化：** Lasso 正则化的正则化项倾向于使一些系数完全等于零，从而实现特征选择（feature selection）。Lasso 可以将某些不相关的特征的系数缩减至零，从而实现模型的稀疏性。

# 3. **解的稳定性：**
#    - **岭回归：** 由于 L2 范数的平方项，在存在共线性的情况下，岭回归的解相对更加稳定。
#    - **Lasso 正则化：** L1 范数的绝对值项使得 Lasso 对于特征之间的高度相关性更敏感，可能导致某些系数在存在共线性时变得不稳定。

# 4. **适用场景：**
#    - **岭回归：** 岭回归适用于处理共线性问题，或者在特征较多时，可以有效防止过拟合。
#    - **Lasso 正则化：** Lasso 适用于具有稀疏性特征的场景，可以用于特征选择，筛选出对目标变量贡献较大的特征。

# 选择使用岭回归还是 Lasso 正则化通常取决于数据的性质、特征之间的关系以及对模型的需求。在实践中，可以通过交叉验证等方法来确定合适的正则化参数 \(\alpha\)。



# 弹性网络（Elastic Net）:
# Elastic Net Regression: 弹性网络是同时使用 L1 和 L2 范数正则化的线性回归模型，结合了 Lasso 和 Ridge 的优点



'''共线性的含义'''

# 共线性是指在回归分析中，自变量之间存在高度相关性或线性关系的现象。当两个或多个自变量之间存在强烈的线性相关性时，就说存在共线性。共线性可能导致一些问题，影响回归模型的性能和解释。

# 具体来说，共线性可能导致以下情况：

# 1. **系数不稳定性：** 共线性使得回归系数的估计变得不稳定。小的数据变动可能导致系数变动较大，使得对系数的解释变得困难。

# 2. **系数方向问题：** 共线性还可能导致系数的符号与期望的相反。这使得对自变量与因变量之间实际关系的解释变得模糊。

# 3. **统计显著性问题：** 共线性可以使得模型中的自变量之间的统计显著性测试变得困难，因为它们之间的相互作用会增加估计的标准误差，降低统计检验的功效。

# 共线性通常通过方差膨胀因子（Variance Inflation Factor，VIF）等方法来检测。VIF表示一个自变量与其他自变量之间的线性关系的强度。如果VIF的值很高，说明存在共线性。解决共线性的方法包括：
# - **特征选择：** 移除与其他特征高度相关的自变量。
# - **岭回归：** 引入正则化项，有助于稳定系数估计，特别是在存在共线性时。
# - **主成分分析（PCA）：** 将高度相关的自变量转换为一组不相关的主成分，减少共线性的影响。

# 在建立回归模型时，处理共线性是非常重要的，以确保模型的稳定性和解释性。



'''是的，Lasso（Least Absolute Shrinkage and Selection Operator）正则化常常用于特征选择。Lasso的目标函数包含了一个L1范数正则化项，它的形式是系数的绝对值之和。这使得Lasso在优化过程中倾向于使一些系数变为零，从而实现了特征选择的效果。

Lasso的目标函数为：

\[ J(\theta) = \text{Least Squares Loss} + \alpha \sum_{i=1}^{n} |\theta_i| \]

其中，\(\theta_i\) 是模型的系数，\(\alpha\) 是正则化参数。

由于L1正则化项的存在，Lasso在解决具有大量特征的问题时，往往会将一些不相关或对目标变量贡献较小的特征的系数缩减至零。这种特性使得Lasso成为一种有力的特征选择工具。

在实际应用中，如果我们面对高维数据集，即特征数量远远大于样本数量的情况，Lasso通常能够自动地将一些无关紧要或高度相关的特征的系数稀疏化，从而达到降维和提高模型解释性的目的。

在scikit-learn等机器学习库中，使用Lasso进行回归时，可以通过调整正则化参数 \(\alpha\) 的值来控制特征选择的程度。'''